# macOS Homebrew Bundle
# Refreshed from LightHouse Keeper 2 on 2026-06-20.
# Run from repo root with: brew bundle --file macos/Brewfile

tap "hudochenkov/sshpass"
tap "itchyny/tap"
tap "nikitabobko/tap"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "yakitrak/yakitrak"

# Core shell/dev tooling
brew "autoconf"
brew "automake"
brew "bat"
brew "btop"
brew "chafa"
brew "cmake"
brew "coreutils"
brew "csvlens"
brew "direnv"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "libfido2"
brew "mdbtools"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "poppler"
brew "qrencode"
brew "ranger"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tokei"
brew "unbound"
brew "unixodbc"
brew "wimlib"
brew "yq"
brew "yt-dlp"
brew "zoxide"

# Runtimes and build systems
brew "cocoapods"
brew "gradle"
brew "kdoctor"
brew "libimobiledevice"
brew "node"
brew "node@20"
brew "openjdk@17"
brew "python@3.13"
brew "qt"
brew "ruby", link: false
brew "ruby@3.2"
brew "ruff"
brew "uv"

# Databases and infra
brew "cloudflared"
brew "libpq", link: true
brew "mysql-client"
brew "openvpn"
brew "postgresql@16", restart_service: :changed
brew "render"
brew "tailscale", restart_service: :changed
brew "terraform"

# AI/media/workflow CLIs
brew "llmfit"
brew "opencode"
brew "steipete/tap/summarize"
brew "whisper-cpp"

# Mobile and Android
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"

# Desktop apps and fonts
cask "anki"
cask "bartender"
cask "blender"
cask "caldigit-docking-utility"
cask "chatgpt"
cask "claude"
cask "codex"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-chrome@beta"
cask "google-drive"
cask "iterm2"
cask "itermai"
cask "keyboard-maestro"
cask "moom"
cask "nikitabobko/tap/aerospace"
cask "obsidian"
cask "ollama-app"
cask "prusaslicer"
cask "shottr"
cask "signal"
cask "slack"
cask "soundsource"
cask "t3-code"
cask "tailscale-app"
cask "telegram"
cask "vysor"
cask "wispr-flow"

# Editor extensions
vscode "anysphere.remote-ssh"
vscode "openai.chatgpt"

# Language/package manager globals
cargo "wasm-pack"
uv "notebooklm-mcp-cli"

npm "@anthropic-ai/claude-code"
npm "@browserbasehq/browse-cli"
npm "@browserbasehq/cli"
npm "@earendil-works/pi-coding-agent"
npm "@expo/ngrok"
npm "@google/gemini-cli"
npm "@googleworkspace/cli"
npm "@mobilenext/mobile-mcp"
npm "@openai/codex"
npm "@playwright/mcp"
npm "clerk"
npm "eas-cli"
npm "firebase-tools"
npm "openclaw"
npm "pnpm"
npm "vercel"
